# The DataFrame Data Structure

In [5]:
import pandas as pd
purchase_1 = pd.Series({'Name': 'John',
                        'Item Purchased': 'Fish Food',
                        'Cost': 22.5})
purchase_2 = pd.Series({'Name': 'Rita',
                        'Item Purchased': 'Bicicle',
                        'Cost': 220})
purchase_3 = pd.Series({'Name': 'Xavi',
                        'Item Purchased': 'Ball',
                        'Cost': 40})
df = pd.DataFrame([purchase_1, purchase_2, purchase_3], index = ['Store 1', 'Store 1', 'Store 2'])
df

          Cost Item Purchased  Name
Store 1   22.5      Fish Food  John
Store 1  220.0        Bicicle  Rita
Store 2   40.0           Ball  Xavi

In [6]:
df.loc['Store 2']

Cost                40
Item Purchased    Ball
Name              Xavi
Name: Store 2, dtype: object

In [7]:
type(df.loc['Store 2'])

pandas.core.series.Series

In [8]:
df.loc['Store 1']

          Cost Item Purchased  Name
Store 1   22.5      Fish Food  John
Store 1  220.0        Bicicle  Rita

In [9]:
df.loc['Store 1', 'Cost']

Store 1     22.5
Store 1    220.0
Name: Cost, dtype: float64

In [10]:
df.T

                  Store 1  Store 1 Store 2
Cost                 22.5      220      40
Item Purchased  Fish Food  Bicicle    Ball
Name                 John     Rita    Xavi

In [11]:
df.T.loc['Cost']

Store 1    22.5
Store 1     220
Store 2      40
Name: Cost, dtype: object

In [12]:
df.loc['Store 1']['Cost']

Store 1     22.5
Store 1    220.0
Name: Cost, dtype: float64

In [13]:
df.loc[:, ['Name', 'Cost']]

         Name   Cost
Store 1  John   22.5
Store 1  Rita  220.0
Store 2  Xavi   40.0

In [14]:
df.drop('Store 1')

         Cost Item Purchased  Name
Store 2  40.0           Ball  Xavi

In [15]:
df

          Cost Item Purchased  Name
Store 1   22.5      Fish Food  John
Store 1  220.0        Bicicle  Rita
Store 2   40.0           Ball  Xavi

In [16]:
copy_df = df.copy()
copy_df = copy_df.drop('Store 1')
copy_df

         Cost Item Purchased  Name
Store 2  40.0           Ball  Xavi

In [17]:
df['Location'] = None
df

          Cost Item Purchased  Name Location
Store 1   22.5      Fish Food  John     None
Store 1  220.0        Bicicle  Rita     None
Store 2   40.0           Ball  Xavi     None